Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: This guide walks you through the process of creating a Quarkus application with https://www.optaplanner.org/[OptaPlanner]'s constraint solving Artificial Intelligence (AI).
ja_jp: このガイドでは、 https://www.optaplanner.org/[OptaPlanner] の制約解決人工知能 (AI) を使用して Quarkus アプリケーションを作成するプロセスについて説明します。

source: This guide walks you through the process of creating a Quarkus application with OptaPlanner's constraint solving Artificial Intelligence (AI).
ja_jp: このガイドでは、OptaPlannerの制約解決人工知能（AI）を使用してQuarkusアプリケーションを作成するプロセスを説明します。

source: This guide will also use the link:https://docs.datastax.com/en/developer/java-driver/latest/manual/mapper[DataStax Object Mapper] – a powerful Java-to-CQL mapping framework that greatly simplifies your application's data access layer code by sparing you the hassle of writing your CQL queries by hand.
ja_jp: このガイドでは、link:https://docs.datastax.com/en/developer/java-driver/latest/manual/mapper[DataStax Object Mapper] も使用します。これは、Java から CQL にマッピングする強力なフレームワークで、CQLクエリーを手動で記述する手間を省くことで、アプリケーションのデータアクセス階層コードを大幅に簡素化します。

source: This guide will explain how to:
ja_jp: このガイドでは、以下の方法を説明します。

source: This guide will help you with:
ja_jp: このガイドでは、次の情報を提供します。

source: This guide will show how to use the `Credentials Provider` provided in the `vault` extension, then we will look at implementing a custom `Credentials Provider`, and finally we will talk about additional considerations regarding implementing a `Credentials Provider` in a new extension.
ja_jp: このガイドでは、 `vault` エクステンションで提供されている `Credentials Provider` の使い方を紹介し、次にカスタム `Credentials Provider` の実装について見ていき、最後に新しいエクステンションで `Credentials Provider` を実装する際の追加考慮事項について説明します。

source: This guide will take as input a native application developed in the xref:building-native-image.adoc[building native image guide].
ja_jp: このガイドでは、 xref:building-native-image.adoc[ネイティブイメージのビルドガイド] で開発したネイティブアプリケーションをインプットとします。

source: This guide will take as input a simple application created with the Quarkus tooling:
ja_jp: このガイドでは、Quarkus ツールを使用して作成されたシンプルなアプリケーションを入力として取り扱います。

source: This guide will take as input an application developed in the xref:getting-started.adoc[Getting Started guide].
ja_jp: 本ガイドでは、 xref:getting-started.adoc[入門ガイド]で開発したアプリケーションを入力とします。

source: This guide's `application.properties` file has already many metrics enabled; you can use its metrics list as a good starting point for exposing useful Cassandra metrics in your application.
ja_jp: 本書の `application.properties` ファイルでは、すでに多くのメトリクスが有効になっています。このメトリクスリストを開始点として使用して、アプリケーションの有用な Cassandra メトリクスを公開すると適切です。

source: This guides covers the usage of LRA to coordinate activities across services.
ja_jp: このガイドでは、サービスをまたいだアクティビティの調整にLRAを使用する方法をカバーします。

source: This guides covers the usage of Software Transactional Memory (STM).
ja_jp: このガイドでは、ソフトウェア・トランザクション・メモリ(STM)の使用法について説明します。

source: This guides explains how to use the Vault credentials provider or implement your own custom one.
ja_jp: このガイドでは、Vault の資格情報プロバイダを使用する方法、または独自のカスタムのものを実装する方法について説明します。

source: This handler is a bridge between the lambda runtime and the Quarkus HTTP framework you are using (JAX-RS, Servlet, etc.)
ja_jp: このハンドラは、ラムダランタイムと、使用しているQuarkus HTTPフレームワーク（JAX-RS、Servletなど）との間のブリッジとなります。

source: This handler is a bridge between the lambda runtime and the Quarkus HTTP framework you are using (Jakarta REST, Servlet, etc.)
ja_jp: このハンドラは、lambdaランタイムと使用しているQuarkus HTTPフレームワーク（Jakarta REST、Servletなど）の間のブリッジとなります。

source: This handler sends logs to a socket. Socket log handler is disabled by default; enable it to use it. When enabled, it sends all log events to a socket, such as a Logstash server.
ja_jp: このハンドラはログをソケットに送信します。 ソケットログハンドラはデフォルトでは無効になっています。 有効にすると、すべてのログイベントを Logstash サーバなどのソケットに送信します。

source: This handler sends logs to a socket. The socket log handler is disabled by default; enable it to use it. When enabled, it sends all log events to a socket, such as a Logstash server.
ja_jp: このハンドラーはログをソケットに送信します。ソケットログハンドラーはデフォルトで無効になっています。使用するには有効にする必要があります。有効にすると、すべてのログイベントを Logstash サーバーなどのソケットに送信します。

source: This handles a lot of the really easy validations while allowing us to spend more time getting the complicated stuff right.
ja_jp: これにより、本当に簡単な検証の多くを処理し、複雑なものを正しくすることに時間を割くことができるようになりました。

source: This has the disadvantage of https://github.com/containers/podman/discussions/14238[disabling container cleanup], so you may find stale containers hanging around. This can be a problem if you're running automated tests.
ja_jp: これには、 https://github.com/containers/podman/discussions/14238[コンテナークリーンアップの無効化] が行われるという欠点があり、古くなったコンテナーがぶら下がる可能性があります。これは、自動テストを実行している場合に問題になることがあります。

source: This has the same effect as the following configuration:
ja_jp: これは、以下の設定と同じ効果があります。

source: This helps in scenarios like HTTP/2, where multiple protocols might be available, allowing for faster protocol selection.
ja_jp: これは、複数のプロトコルが利用できる可能性がある HTTP/2 などのシナリオで役立ち、プロトコルの選択を高速化します。

source: This helps in scenarios such as HTTP/2, where multiple protocols can be available, enabling faster protocol selection.
ja_jp: これは、複数のプロトコルが利用可能な HTTP/2 などのシナリオで役立ち、より迅速なプロトコル選択を可能にします。

source: This implementation is straightforward.
ja_jp: この実装は単純です。

source: This implies that you no longer need to install a JVM on your production environment, as the runtime technology is included in the produced binary and optimized to run with minimal resources.
ja_jp: これは、生成されたバイナリーにランタイムテクノロジーが含まれ、 最小限のリソースで実行するように最適化されているため、 実稼働環境に JVM をインストールする必要がなくなることを意味します。

source: This implies that you no longer need to install a JVM on your production environment, as the runtime technology is included in the produced binary, and optimized to run with minimal resource overhead.
ja_jp: これは、生成されたバイナリーにランタイム技術が含まれており、最小限のリソースオーバーヘッドで実行できるように最適化されているため、本番環境にJVMをインストールする必要がないことを意味します。

source: This implies that you no longer need to install a JVM on your production environment, as the runtime technology is included in the produced binary, and optimized to run with minimal resources.
ja_jp: これは、生成されたバイナリーにランタイムテクノロジーが含まれ、 最小限のリソースで実行するように最適化されているため、 実稼働環境に JVM をインストールする必要がなくなることを意味します。

source: This includes the following:
ja_jp: これには、以下が含まれます。

source: This index is created by default on the project on which Quarkus is configured for, thanks to our Maven and Gradle plugins.
ja_jp: このインデックスは、 Maven と Gradle プラグインにより、 Quarkus が設定されているプロジェクトにデフォルトで作成されます。

source: This index, based on https://github.com/wildfly/jandex[Jandex], is a very important part of the Quarkus bootstrap.
ja_jp: link:https://github.com/wildfly/jandex[Jandex]をベースにしたこの指標は、Quarkusのブートストラップにおいて非常に重要な役割を果たしています。

source: This indicates the comma-separated list of roles added to the target Principal representation attributes.
ja_jp: これは、対象のプリンシパル表現属性に追加されたロールのコンマ区切りリストを示します。

source: This indicates the comma-separated list of roles added to the target principal representation attributes.
ja_jp: ここでは対象のプリンシパル表現属性に追加されたロールのコンマ区切りリストを示します。

source: This indicates the field used for the password. This defaults to using bcrypt hashed passwords, but you can also configure it for clear text passwords or custom passwords.
ja_jp: これは、パスワードに使用するフィールドを示します。これはデフォルトでは bcrypt ハッシュ化されたパスワードを使用するように設定されていますが、クリアテキストパスワードやカスタムパスワード用に設定することもできます。

source: This indicates the field used for the user name.
ja_jp: これは、ユーザー名に使用されるフィールドを示します。

source: This information about pinning cases applies to PostgreSQL JDBC driver 42.5.4 and earlier on Java 21-23. For PostgreSQL JDBC driver 42.6.0 and later, virtually all synchronized methods have been replaced by reentrant locks. For more information, see the link:https://jdbc.postgresql.org/changelogs/2023-03-17-42.6.0-release/[Notable Changes] for PostgreSQL JDBC driver 42.6.0.
ja_jp: ピニングのケースに関するこの情報は、Java 21-23 における PostgreSQL JDBC ドライバー 42.5.4 以前に適用されます。PostgreSQL JDBC ドライバー 42.6.0 以降では、事実上すべての同期されたメソッドが再入可能ロックに置き換えられています。詳細については、PostgreSQL JDBC ドライバー 42.6.0 の link:https://jdbc.postgresql.org/changelogs/2023-03-17-42.6.0-release/[Notable Changes] を参照してください。

source: This information about pinning cases applies to PostgreSQL JDBC driver 42.5.4 and earlier. For PostgreSQL JDBC driver 42.6.0 and later, virtually all synchronized methods have been replaced by reentrant locks. For more information, see the link:https://jdbc.postgresql.org/changelogs/2023-03-17-42.6.0-release/[Notable Changes] for PostgreSQL JDBC driver 42.6.0.
ja_jp: このピンニングのケースに関する情報は、PostgreSQL JDBC ドライバー 42.5.4 以前に適用されます。 PostgreSQL JDBC ドライバー 42.6.0 以降では、事実上すべての同期されたメソッドが再入可能ロックに置き換えられています。 詳細は、PostgreSQL JDBC ドライバー 42.6.0 の link:https://jdbc.postgresql.org/changelogs/2023-03-17-42.6.0-release/[Notable Changes] を参照してください。

source: This information is not static per library (e.g. Hibernate) but the framework has the semantic knowledge and knows which classes need to have reflection (for example @Entity classes)
ja_jp: この情報はライブラリ(Hibernateなど)ごとに静的ではありませんが、フレームワークはセマンティックな知識を持っており、どのクラスがリフレクションを必要とするかを知っています(例えば@Entityクラスなど)。

source: This information is stored in an AOT cache file.
ja_jp: この情報は AOT キャッシュファイルに保存されます。

source: This initial step involves the LLM breaking down the complex user query into its constituent parts, identifying key factors, and performing an initial analysis. This could involve understanding the problem, identifying relevant data points, or defining the scope of the task.
ja_jp: この最初のステップでは、LLM が複雑なユーザー クエリを構成要素に分解し、主要な要因を特定し、初期分析を実行します。これには、問題の理解、関連データポイントの特定、またはタスクの範囲の定義が含まれる場合があります。

source: This initial version will print `Hello World` when run.
ja_jp: この初期バージョンを実行すると `Hello World` を表示します。

source: This injection point will not result in an ambiguous dependency even if there are multiple beans that implement the `Dictionary` type.
ja_jp: このインジェクションポイントは、 `Dictionary` 型を実装した複数のBeanがあっても、曖昧な依存関係にはなりません。

source: This instance is retrieved and used to configure the client used by the connector. You need to indicate the name of the client using the `client-configuration`, `consumer-configuration` or `producer-configuration` attributes:
ja_jp: このインスタンスは、コネクターが使用するクライアントを設定するために取得および使用されます。 `client-configuration`、 `consumer-configuration`、または `producer-configuration` 属性を使用してクライアントの名前を指定する必要があります。

source: This instance is retrieved and used to configure the client used by the connector. You need to indicate the name of the client using the `client-options-name` attribute:
ja_jp: このインスタンスが取得され、コネクターが使用するクライアントを設定するために使用されます。 `client-options-name` 属性を使用してクライアントの名前を指定する必要があります。

source: This instructs the failsafe-maven-plugin to run integration-test and indicates the location of the produced native executable.
ja_jp: これは、failsaf-maven-plugin が integration-test を実行するように指示し、生成されたネイティブ実行可能ファイルの場所を示します。

source: This instructs the failsafe-maven-plugin to run integration-test.
ja_jp: これは、failsafe-maven-plugin に統合テストを実行するように指示します。

source: This integration minimizes configuration effort and adheres to Quarkus' philosophy of doing as much as possible at build time.
ja_jp: この統合により設定の手間が最小限に抑えられ、可能な限りビルド時に処理を行うという Quarkus の哲学に従っています。

source: This integration provides a seamless development experience while giving you full control over your service configurations.
ja_jp: この統合により、シームレスな開発エクスペリエンスが提供され、サービスの構成を完全に制御できます。

source: This interceptor is applied to all injected gRPC clients.
ja_jp: このインターセプターは、インジェクトされたすべてのgRPCクライアントに適用されます。

source: This interface allows you to dynamically create tenant configurations at runtime:
ja_jp: このインターフェイスを使用すると、実行時にテナント設定を動的に作成することができます。

source: This interface exposes operations that will be used in our REST service. Again, the annotation `@Dao` comes from the DataStax Object Mapper, which will also automatically generate an implementation of this interface for you.
ja_jp: このインターフェイスは、REST サービスで使用される操作を公開します。繰り返しになりますが、アノテーション `@Dao` は DataStaxObjectMapper から取得され、このインターフェイスの実装も自動的に生成されます。

source: This is a background function that takes as parameter a `io.quarkus.funqy.gcp.functions.event.PubsubMessage`, this is a convenient class to deserialize a PubSub message.
ja_jp: これは、 `io.quarkus.funqy.gcp.functions.event.PubsubMessage` をパラメーターとするバックグルアンド関数で、PubSub メッセージをデシリアライズする便利なクラスです。

source: This is a background function that takes as parameter a `io.quarkus.funqy.gcp.functions.event.StorageEvent`, this is a convenient class to deserialize a Google Storage event.
ja_jp: これは、 `io.quarkus.funqy.gcp.functions.event.StorageEvent` をパラメーターとするバックグラウンド関数で、Google Storage イベントをデシリアライズするための便利なクラスです。

source: This is a basic REST endpoint that does not have any of the {extension-name} specific features, so let's add some.
ja_jp: これは {extension-name} 特有の機能を持たない基本的なRESTエンドポイントなので、いくつか追加してみましょう。

source: This is a black box test that supports the same set features and has the same limitations.
ja_jp: これは、同じ機能セットをサポートし、同じ制限を持つブラックボックステストです。

source: This is a build time property, it cannot be changed at runtime after your application is built.
ja_jp: これはビルド時プロパティーで、アプリケーションがビルドされた後、ランタイムに変更することはできません。

source: This is a cloud events function, that takes as parameter a `io.cloudevents.CloudEvent`, inside it the `getData()` method will return the event content, a storage event in this case.
ja_jp: これはクラウドイベントの関数で、パラメータとして `io.cloudevents.CloudEvent` を受け取り、その内部で `getData()` メソッドがイベントの内容（この場合はストレージイベント）を返します。

source: This is a collection of preferred term in the documentation and website. Please stay within these terms for consistency.
ja_jp: ドキュメントやウェブサイトで好まれる用語を集めたものです。一貫性を保つために、これらの用語の範囲内にとどめてください。

source: This is a collection of preferred terms in the documentation and website. Please stay within these terms for consistency.
ja_jp: これは、ドキュメントやウェブサイトにおける好ましい用語のコレクションです。一貫性を保つために、これらの範囲内で用語を使用してください。

source: This is a configuration property consumed by the `quarkus-vertx-http` extension.
ja_jp: これは `quarkus-vertx-http` エクステンションによって消費される設定プロパティーです。

source: This is a constructor injection. In fact, this code would not work in regular CDI implementations where a bean with a normal scope must always declare a no-args constructor and the bean constructor must be annotated with `@Inject`. However, in Quarkus we detect the absence of no-args constructor and "add" it directly in the bytecode. It's also not necessary to add `@Inject` if there is only one constructor present.
ja_jp: これはコンストラクタのインジェクションです。実際には、このコードは通常のCDI実装では動作しません。通常のスコープを持つBeanは常にno-argsコンストラクタを宣言しなければならず、Beanのコンストラクタは `@Inject` でアノテーションされなければなりません。しかし、Quarkusでは、no-argsコンストラクタが存在しないことを検出し、バイトコードに直接「追加」します。また、コンストラクタが1つしかない場合は、 `@Inject` を追加する必要はありません。

source: This is a constructor injection. In fact, this code would not work in regular CDI implementations where a bean with a normal scope must always declare a no-args constructor and the bean constructor must be annotated with `@Inject`. However, in Quarkus, we detect the absence of no-args constructor and "add" it directly in the bytecode. It's also not necessary to add `@Inject` if there is only one constructor present.
ja_jp: これはコンストラクタインジェクションです。 実際には、このコードは通常の CDI 実装では機能しません。通常のスコープを持つ Bean は常に引数なしのコンストラクタを宣言する必要があり、Bean のコンストラクタは `@Inject` でアノテーションされなければならないためです。 しかし、Quarkus では、引数なしのコンストラクタの欠如を検出し、バイトコードに直接「追加」します。 また、コンストラクタが 1 つしかない場合は、 `@Inject` を追加する必要はありません。

source: This is a development cluster, do not use in production.
ja_jp: これは開発クラスターであり、本番では使用しないでください。

source: This is a field injection point. It tells the container that `Translator` depends on the `Dictionary` bean. If there is no matching bean the build fails.
ja_jp: これはフィールド注入ポイントです。 `Translator` が `Dictionary` Beanに依存していることをコンテナーに伝えます。マッチするBeanがない場合、ビルドは失敗します。

source: This is a good example of how to integrate a Kafka consumer with another downstream, in this example exposing it as a Server-Sent Events endpoint.
ja_jp: これは、Kafka コンシューマーを別のダウンストリームと統合する方法の良い例で、この例では Server-Sent Events エンドポイントとして公開しています。

source: This is a list of planning entities, because they change during solving.
ja_jp: 解決中に変更されるため、これはプランニングエンティティーのリストです。

source: This is a list of problem facts, because they do not change during solving.
ja_jp: 解決中に変更されないため、これは問題の事実のリストです。

source: This is a perfect example of the mismatch between the reactive stack and the virtual threads. The fundamental hypothesis are completely different and result in different optimizations. Netty expects a system using few event-loops (as many event-loops as CPU cores by default in Quarkus), but it gets hundreds of thousands of threads. You can refer to link:https://mail.openjdk.org/pipermail/loom-dev/2022-July/004844.html[this mail] to get more information on how we envision our future with virtual threads.
ja_jp: これはリアクティブスタックと仮想スレッドのミスマッチの好例です。根本的な仮説が全く異なるため、結果として最適化も異なってきます。Nettyは少数のイベントループ(QuarkusのデフォルトではCPUのコア数と同じ数のイベントループ)を使用するシステムを想定していますが、何十万ものスレッドを取得します。私たちが仮想スレッドを使ってどのような未来を描いているかについては、 link:https://mail.openjdk.org/pipermail/loom-dev/2022-July/004844.html[このメール] を参照してください。

source: This is a permission set that references the previously defined policy. `roles1` is an arbitrary name, you can call the permission sets whatever you want.
ja_jp: これは以前に定義されたポリシーを参照するパーミッションセットです。 `roles1` は任意の名前ですので、好きなようにパーミッションセットを呼び出すことができます。

source: This is a programmatic alternative to a method annotated with `@Scheduled(identity = "myJob", cron = "0/5 * * * * ?")`.
ja_jp: これは、 `@Scheduled(identity = "myJob", cron = "0/5 * * * * ?")` でアノテーションされたメソッドに代わるプログラム的な代替です。

source: This is a pseudo-scope. The instances are not shared and every injection point spawns a new instance of the dependent bean. The lifecycle of dependent bean is bound to the bean injecting it - it will be created and destroyed along with the bean injecting it.
ja_jp: これは疑似スコープです。インスタンスは共有されておらず、すべての注入ポイントは依存Beanの新しいインスタンスをスポーンします。依存Beanのライフサイクルは、それを注入するBeanに拘束されています。

source: This is a public resource to where the logged out user should be returned to.
ja_jp: これは、ログアウトしたユーザーが返されるパブリックリソースです。

source: This is a quick introduction to datasource configuration. If you want a better understanding of how all this works, this guide has a lot more information in the subsequent paragraphs.
ja_jp: これはデータソースの設定についての簡単な紹介です。すべての動作について理解を深める場合は、このガイドの後の段落でさらに多くの情報を得ることができます。

source: This is a regular Google Cloud Function implementation, so it needs to implement `com.google.cloud.functions.BackgroundFunction`.
ja_jp: これは通常のGoogle Cloud Functionの実装なので、 `com.google.cloud.functions.BackgroundFunction` を実装する必要があります。

source: This is a regular Google Cloud Function implementation, so it needs to implement `com.google.cloud.functions.CloudEventsFunction`.
ja_jp: これは通常のGoogle Cloud Functionの実装なので、 `com.google.cloud.functions.CloudEventsFunction` を実装する必要があります。

source: This is a regular Google Cloud Function implementation, so it needs to implement `com.google.cloud.functions.HttpFunction`.
ja_jp: これは通常の Google Cloud Function の実装なので、 `com.google.cloud.functions.HttpFunction` を実装する必要があります。

source: This is a regular Google Cloud Function implementation, so it needs to implement `com.google.cloud.functions.RawBackgroundFunction`.
ja_jp: これは通常のGoogle Cloud Functionの実装なので、 `com.google.cloud.functions.RawBackgroundFunction` を実装する必要があります。

source: This is a regular finder method
ja_jp: これは通常のファインダーメソッドです

source: This is a safeguard: for versions of the database older than what is configured, Hibernate ORM may generate SQL that is invalid which would lead to runtime exceptions.
ja_jp: これは安全策です。設定されたバージョンよりも古いデータベースを使用すると、 Hibernate ORM が無効な SQL を生成し、実行時例外が発生する可能性があります。

source: This is a scope annotation. It tells the container which context to associate the bean instance with. In this particular case, a *single bean instance* is created for the application and used by all other beans that inject `Translator`.
ja_jp: これはスコープアノテーションです。これはコンテナーに、Beanのインスタンスをどのコンテキストに関連付けるかを伝えます。この特定のケースでは、 *単一のBeanインスタンス* がアプリケーション用に作成され、 `Translator` の注入を行う他の全てのBeanによって使用されます。

source: This is a simple analyzer separating the words on spaces, removing any non-ASCII characters by its ASCII counterpart (and thus removing accents) and putting everything in lowercase. It is used in our examples for the author's names.
ja_jp: これは、スペースで単語を分離し、ASCII以外の文字をASCIIの対応する文字で置換し（したがって、アクセントを除去し）、すべてを小文字にするシンプルなアナライザーです。これは、例では著者名に使用されています。

source: This is a standalone line and will be removed.
ja_jp: これはスタンドアロン行なので削除されます。

source: This is a standalone line.
ja_jp: これはスタンドアロン行です。

source: This is a standard Kubernetes service definition YAML file.
ja_jp: これはKubernetesの標準的なサービス定義YAMLファイルです。

source: This is a standard Quarkus test that must be annotated by `@QuarkusTest`.
ja_jp: これは標準的なQuarkusのテストであり、 `@QuarkusTest` によってアノテーションを付ける必要があります。

source: This is a story about Project Leyden. And this is not a story about Project Leyden.
ja_jp: これは Project Leyden にまつわる物語です。そして、これは Project Leyden だけの物語ではありません。

source: This is a story about Project Leyden. And this is not a story about Project Leyden. It is a story about how Project Leyden gave us a new perspective on how we think about startup performance in Quarkus.
ja_jp: これは Project Leyden にまつわる物語です。そして、これは Project Leyden だけの物語ではありません。Project Leyden が、Quarkus における起動パフォーマンスの考え方にいかに新しい視点を与えてくれたかという物語です。

source: This is a user-defined configuration property.
ja_jp: これは、ユーザー定義の設定プロパティーです。

source: This is a very common case as JSON libraries typically use reflection to serialize the objects to JSON:
ja_jp: これは非常によくあるケースです。JSONライブラリは一般的にリフレクションを使用してオブジェクトをJSONにシリアライズする為です。

source: This is a very flexible mechanism.
ja_jp: これは非常に柔軟なメカニズムです。

source: This is a very simple example using RBAC policies to govern access to your resources. However, Keycloak supports other types of policies that you can use to perform even more fine-grained access control. By using this example, you'll see that your application is completely decoupled from your authorization policies with enforcement being purely based on the accessed resource.
ja_jp: これは、RBACポリシーを使用してリソースへのアクセスを制御する非常にシンプルな例です。しかし、Keycloakは他のタイプのポリシーをサポートしており、より詳細なアクセス制御を行うために使用することができます。この例を使用すると、アプリケーションが認可ポリシーから完全に切り離されており、エンフォースメントは純粋にアクセスされたリソースに基づいていることがわかるでしょう。

source: This is a way for Cryostat clients (end users or other automated tooling) to tell Cryostat how and where to find a single target application instance. A Custom Target definition is at its core simply a network-reachable remote connection JMX URL and a human-readable alias. These can be created in the Cryostat web client by clicking the `+++` (Plus) icon on the target selection dropdown or by using your preferred HTTP client:
ja_jp: これは、Cryostat クライアント（エンドユーザまたは他の自動化ツール）が、単一のターゲットアプリケーションインスタンスを見つける方法と場所を Cryostat に指示するための方法です。カスタムターゲット定義は、その中核にある、ネットワークに到達可能なリモート接続JMX URLと人間が読めるエイリアスのみです。これらは、ターゲット選択のドロップダウンで `+` (プラス)アイコンをクリックするか、お好みのHTTPクライアントを使用して、Cryostatウェブクライアントで作成できます。

source: This is about avoiding the cost when you don't actually need it.
ja_jp: これは、実際には必要のないときのコストを避けるための話です。

source: This is achieved with a Micrometer registry implemented with the OpenTelemetry SDK, allowing integration of Micrometer Metrics, OpenTelemetry Traces and Logs into a unified telemetry output using the OTLP protocol.
ja_jp: これは、OpenTelemetry SDK で実装された Micrometer レジストリによって実現され、Micrometer メトリクス、OpenTelemetry トレース、およびログを OTLP プロトコルを使用した統合テレメトリー出力に統合できます。

source: This is all that is needed for an endpoint like this one to return the currently-authenticated user's profile with `GET http://localhost:8080/github/userinfo` and access it as the individual `UserInfo` properties:
ja_jp: このようなエンドポイントに対して必要なのは、現在認証されているユーザーのプロファイルを `GET http://localhost:8080/github/userinfo` で返し、個々の `UserInfo` のプロパティーとしてアクセスすることです。

source: This is all that is needed to write the information to JFR.
ja_jp: JFR に情報を書き込むために必要なのはこれだけです。

source: This is all what is needed as Quarkus OIDC automatically associates `scope` claim values as permissions with the current security identity.
ja_jp: 以上を実行することで、Quarkus OIDC は `scope` クレーム値を現行のセキュリティーアイデンティティーの権限として自動的に関連付けます。
